zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPfi_reg.h
/** \brief 4000, DBAB Record 0 */
#define PFI3_DBAB0_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8984000u)
/** Alias (User Manual Name) for PFI3_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI3_DBAB0_DBABRECORD.
*/
#define PFI3_DBABRECORD0 (PFI3_DBAB0_DBABRECORD)

/** \brief 4020, DBAB Record 1 */
#define PFI3_DBAB1_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8984020u)
/** Alias (User Manual Name) for PFI3_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI3_DBAB1_DBABRECORD.
*/
#define PFI3_DBABRECORD1 (PFI3_DBAB1_DBABRECORD)

/** \brief 8000, MBAB Record 0 */
#define PFI3_MBAB0_MBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_MBAB_MBABRECORD*)0xA8988000u)
/** Alias (User Manual Name) for PFI3_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI3_MBAB0_MBABRECORD.
*/
#define PFI3_MBABRECORD0 (PFI3_MBAB0_MBABRECORD)

/** \brief C000, ZBAB Record 0 */
#define PFI3_ZBAB0_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C000u)
/** Alias (User Manual Name) for PFI3_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB0_ZBABRECORD.
*/
#define PFI3_ZBABRECORD0 (PFI3_ZBAB0_ZBABRECORD)

/** \brief C020, ZBAB Record 1 */
#define PFI3_ZBAB1_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C020u)
/** Alias (User Manual Name) for PFI3_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB1_ZBABRECORD.
*/
#define PFI3_ZBABRECORD1 (PFI3_ZBAB1_ZBABRECORD)

/** \brief C040, ZBAB Record 2 */
#define PFI3_ZBAB2_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C040u)
/** Alias (User Manual Name) for PFI3_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB2_ZBABRECORD.
*/
#define PFI3_ZBABRECORD2 (PFI3_ZBAB2_ZBABRECORD)

/** \brief C060, ZBAB Record 3 */
#define PFI3_ZBAB3_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA898C060u)
/** Alias (User Manual Name) for PFI3_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI3_ZBAB3_ZBABRECORD.
*/
#define PFI3_ZBABRECORD3 (PFI3_ZBAB3_ZBABRECORD)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Pfi_Registers_Cfg_Pfi4
 * \{  */
/** \brief 0, ECC Read Register */
#define PFI4_ECCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCR*)0xA8C80000u)

/** \brief 20, ECC Status Register */
#define PFI4_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCS*)0xA8C80020u)

/** \brief 2000, SBAB Record 0 */
#define PFI4_SBAB0_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82000u)
/** Alias (User Manual Name) for PFI4_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB0_SBABRECORD.
*/
#define PFI4_SBABRECORD0 (PFI4_SBAB0_SBABRECORD)

/** \brief 2020, SBAB Record 1 */
#define PFI4_SBAB1_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82020u)
/** Alias (User Manual Name) for PFI4_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB1_SBABRECORD.
*/
#define PFI4_SBABRECORD1 (PFI4_SBAB1_SBABRECORD)

/** \brief 2040, SBAB Record 2 */
#define PFI4_SBAB2_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82040u)
/** Alias (User Manual Name) for PFI4_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB2_SBABRECORD.
*/
#define PFI4_SBABRECORD2 (PFI4_SBAB2_SBABRECORD)

/** \brief 2060, SBAB Record 3 */
#define PFI4_SBAB3_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82060u)
/** Alias (User Manual Name) for PFI4_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB3_SBABRECORD.
*/
#define PFI4_SBABRECORD3 (PFI4_SBAB3_SBABRECORD)

/** \brief 2080, SBAB Record 4 */
#define PFI4_SBAB4_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82080u)
/** Alias (User Manual Name) for PFI4_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB4_SBABRECORD.
*/
#define PFI4_SBABRECORD4 (PFI4_SBAB4_SBABRECORD)

/** \brief 20A0, SBAB Record 5 */
#define PFI4_SBAB5_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C820A0u)
/** Alias (User Manual Name) for PFI4_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB5_SBABRECORD.
*/
#define PFI4_SBABRECORD5 (PFI4_SBAB5_SBABRECORD)

/** \brief 20C0, SBAB Record 6 */
#define PFI4_SBAB6_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C820C0u)
/** Alias (User Manual Name) for PFI4_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB6_SBABRECORD.
*/
#define PFI4_SBABRECORD6 (PFI4_SBAB6_SBABRECORD)

/** \brief 20E0, SBAB Record 7 */
#define PFI4_SBAB7_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C820E0u)
/** Alias (User Manual Name) for PFI4_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB7_SBABRECORD.
*/
#define PFI4_SBABRECORD7 (PFI4_SBAB7_SBABRECORD)

/** \brief 2100, SBAB Record 8 */
#define PFI4_SBAB8_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82100u)
/** Alias (User Manual Name) for PFI4_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB8_SBABRECORD.
*/
#define PFI4_SBABRECORD8 (PFI4_SBAB8_SBABRECORD)

/** \brief 2120, SBAB Record 9 */
#define PFI4_SBAB9_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82120u)
/** Alias (User Manual Name) for PFI4_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB9_SBABRECORD.
*/
#define PFI4_SBABRECORD9 (PFI4_SBAB9_SBABRECORD)

