zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPfi_reg.h
/** \brief 2140, SBAB Record 10 */
#define PFI4_SBAB10_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82140u)
/** Alias (User Manual Name) for PFI4_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB10_SBABRECORD.
*/
#define PFI4_SBABRECORD10 (PFI4_SBAB10_SBABRECORD)

/** \brief 2160, SBAB Record 11 */
#define PFI4_SBAB11_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82160u)
/** Alias (User Manual Name) for PFI4_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB11_SBABRECORD.
*/
#define PFI4_SBABRECORD11 (PFI4_SBAB11_SBABRECORD)

/** \brief 2180, SBAB Record 12 */
#define PFI4_SBAB12_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82180u)
/** Alias (User Manual Name) for PFI4_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB12_SBABRECORD.
*/
#define PFI4_SBABRECORD12 (PFI4_SBAB12_SBABRECORD)

/** \brief 21A0, SBAB Record 13 */
#define PFI4_SBAB13_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C821A0u)
/** Alias (User Manual Name) for PFI4_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB13_SBABRECORD.
*/
#define PFI4_SBABRECORD13 (PFI4_SBAB13_SBABRECORD)

/** \brief 21C0, SBAB Record 14 */
#define PFI4_SBAB14_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C821C0u)
/** Alias (User Manual Name) for PFI4_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB14_SBABRECORD.
*/
#define PFI4_SBABRECORD14 (PFI4_SBAB14_SBABRECORD)

/** \brief 21E0, SBAB Record 15 */
#define PFI4_SBAB15_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C821E0u)
/** Alias (User Manual Name) for PFI4_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB15_SBABRECORD.
*/
#define PFI4_SBABRECORD15 (PFI4_SBAB15_SBABRECORD)

/** \brief 2200, SBAB Record 16 */
#define PFI4_SBAB16_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8C82200u)
/** Alias (User Manual Name) for PFI4_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI4_SBAB16_SBABRECORD.
*/
#define PFI4_SBABRECORD16 (PFI4_SBAB16_SBABRECORD)

/** \brief 4000, DBAB Record 0 */
#define PFI4_DBAB0_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8C84000u)
/** Alias (User Manual Name) for PFI4_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI4_DBAB0_DBABRECORD.
*/
#define PFI4_DBABRECORD0 (PFI4_DBAB0_DBABRECORD)

/** \brief 4020, DBAB Record 1 */
#define PFI4_DBAB1_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8C84020u)
/** Alias (User Manual Name) for PFI4_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI4_DBAB1_DBABRECORD.
*/
#define PFI4_DBABRECORD1 (PFI4_DBAB1_DBABRECORD)

/** \brief 8000, MBAB Record 0 */
#define PFI4_MBAB0_MBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_MBAB_MBABRECORD*)0xA8C88000u)
/** Alias (User Manual Name) for PFI4_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI4_MBAB0_MBABRECORD.
*/
#define PFI4_MBABRECORD0 (PFI4_MBAB0_MBABRECORD)

/** \brief C000, ZBAB Record 0 */
#define PFI4_ZBAB0_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8C8C000u)
/** Alias (User Manual Name) for PFI4_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI4_ZBAB0_ZBABRECORD.
*/
#define PFI4_ZBABRECORD0 (PFI4_ZBAB0_ZBABRECORD)

/** \brief C020, ZBAB Record 1 */
#define PFI4_ZBAB1_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8C8C020u)
/** Alias (User Manual Name) for PFI4_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI4_ZBAB1_ZBABRECORD.
*/
#define PFI4_ZBABRECORD1 (PFI4_ZBAB1_ZBABRECORD)

/** \brief C040, ZBAB Record 2 */
#define PFI4_ZBAB2_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8C8C040u)
/** Alias (User Manual Name) for PFI4_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI4_ZBAB2_ZBABRECORD.
*/
#define PFI4_ZBABRECORD2 (PFI4_ZBAB2_ZBABRECORD)

/** \brief C060, ZBAB Record 3 */
#define PFI4_ZBAB3_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8C8C060u)
/** Alias (User Manual Name) for PFI4_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI4_ZBAB3_ZBABRECORD.
*/
#define PFI4_ZBABRECORD3 (PFI4_ZBAB3_ZBABRECORD)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Pfi_Registers_Cfg_Pfi5
 * \{  */
/** \brief 0, ECC Read Register */
#define PFI5_ECCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCR*)0xA8F80000u)

/** \brief 20, ECC Status Register */
#define PFI5_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ECCS*)0xA8F80020u)

/** \brief 2000, SBAB Record 0 */
#define PFI5_SBAB0_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82000u)
/** Alias (User Manual Name) for PFI5_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB0_SBABRECORD.
*/
#define PFI5_SBABRECORD0 (PFI5_SBAB0_SBABRECORD)

/** \brief 2020, SBAB Record 1 */
#define PFI5_SBAB1_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82020u)
/** Alias (User Manual Name) for PFI5_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB1_SBABRECORD.
*/
#define PFI5_SBABRECORD1 (PFI5_SBAB1_SBABRECORD)

/** \brief 2040, SBAB Record 2 */
#define PFI5_SBAB2_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82040u)
/** Alias (User Manual Name) for PFI5_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB2_SBABRECORD.
*/
#define PFI5_SBABRECORD2 (PFI5_SBAB2_SBABRECORD)

