zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxPfi_reg.h
/** \brief 2060, SBAB Record 3 */
#define PFI5_SBAB3_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82060u)
/** Alias (User Manual Name) for PFI5_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB3_SBABRECORD.
*/
#define PFI5_SBABRECORD3 (PFI5_SBAB3_SBABRECORD)

/** \brief 2080, SBAB Record 4 */
#define PFI5_SBAB4_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82080u)
/** Alias (User Manual Name) for PFI5_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB4_SBABRECORD.
*/
#define PFI5_SBABRECORD4 (PFI5_SBAB4_SBABRECORD)

/** \brief 20A0, SBAB Record 5 */
#define PFI5_SBAB5_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F820A0u)
/** Alias (User Manual Name) for PFI5_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB5_SBABRECORD.
*/
#define PFI5_SBABRECORD5 (PFI5_SBAB5_SBABRECORD)

/** \brief 20C0, SBAB Record 6 */
#define PFI5_SBAB6_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F820C0u)
/** Alias (User Manual Name) for PFI5_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB6_SBABRECORD.
*/
#define PFI5_SBABRECORD6 (PFI5_SBAB6_SBABRECORD)

/** \brief 20E0, SBAB Record 7 */
#define PFI5_SBAB7_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F820E0u)
/** Alias (User Manual Name) for PFI5_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB7_SBABRECORD.
*/
#define PFI5_SBABRECORD7 (PFI5_SBAB7_SBABRECORD)

/** \brief 2100, SBAB Record 8 */
#define PFI5_SBAB8_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82100u)
/** Alias (User Manual Name) for PFI5_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB8_SBABRECORD.
*/
#define PFI5_SBABRECORD8 (PFI5_SBAB8_SBABRECORD)

/** \brief 2120, SBAB Record 9 */
#define PFI5_SBAB9_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82120u)
/** Alias (User Manual Name) for PFI5_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB9_SBABRECORD.
*/
#define PFI5_SBABRECORD9 (PFI5_SBAB9_SBABRECORD)

/** \brief 2140, SBAB Record 10 */
#define PFI5_SBAB10_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82140u)
/** Alias (User Manual Name) for PFI5_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB10_SBABRECORD.
*/
#define PFI5_SBABRECORD10 (PFI5_SBAB10_SBABRECORD)

/** \brief 2160, SBAB Record 11 */
#define PFI5_SBAB11_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82160u)
/** Alias (User Manual Name) for PFI5_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB11_SBABRECORD.
*/
#define PFI5_SBABRECORD11 (PFI5_SBAB11_SBABRECORD)

/** \brief 2180, SBAB Record 12 */
#define PFI5_SBAB12_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82180u)
/** Alias (User Manual Name) for PFI5_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB12_SBABRECORD.
*/
#define PFI5_SBABRECORD12 (PFI5_SBAB12_SBABRECORD)

/** \brief 21A0, SBAB Record 13 */
#define PFI5_SBAB13_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F821A0u)
/** Alias (User Manual Name) for PFI5_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB13_SBABRECORD.
*/
#define PFI5_SBABRECORD13 (PFI5_SBAB13_SBABRECORD)

/** \brief 21C0, SBAB Record 14 */
#define PFI5_SBAB14_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F821C0u)
/** Alias (User Manual Name) for PFI5_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB14_SBABRECORD.
*/
#define PFI5_SBABRECORD14 (PFI5_SBAB14_SBABRECORD)

/** \brief 21E0, SBAB Record 15 */
#define PFI5_SBAB15_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F821E0u)
/** Alias (User Manual Name) for PFI5_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB15_SBABRECORD.
*/
#define PFI5_SBABRECORD15 (PFI5_SBAB15_SBABRECORD)

/** \brief 2200, SBAB Record 16 */
#define PFI5_SBAB16_SBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_SBAB_SBABRECORD*)0xA8F82200u)
/** Alias (User Manual Name) for PFI5_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI5_SBAB16_SBABRECORD.
*/
#define PFI5_SBABRECORD16 (PFI5_SBAB16_SBABRECORD)

/** \brief 4000, DBAB Record 0 */
#define PFI5_DBAB0_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8F84000u)
/** Alias (User Manual Name) for PFI5_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI5_DBAB0_DBABRECORD.
*/
#define PFI5_DBABRECORD0 (PFI5_DBAB0_DBABRECORD)

/** \brief 4020, DBAB Record 1 */
#define PFI5_DBAB1_DBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_DBAB_DBABRECORD*)0xA8F84020u)
/** Alias (User Manual Name) for PFI5_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI5_DBAB1_DBABRECORD.
*/
#define PFI5_DBABRECORD1 (PFI5_DBAB1_DBABRECORD)

/** \brief 8000, MBAB Record 0 */
#define PFI5_MBAB0_MBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_MBAB_MBABRECORD*)0xA8F88000u)
/** Alias (User Manual Name) for PFI5_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI5_MBAB0_MBABRECORD.
*/
#define PFI5_MBABRECORD0 (PFI5_MBAB0_MBABRECORD)

/** \brief C000, ZBAB Record 0 */
#define PFI5_ZBAB0_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8F8C000u)
/** Alias (User Manual Name) for PFI5_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI5_ZBAB0_ZBABRECORD.
*/
#define PFI5_ZBABRECORD0 (PFI5_ZBAB0_ZBABRECORD)

/** \brief C020, ZBAB Record 1 */
#define PFI5_ZBAB1_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8F8C020u)
/** Alias (User Manual Name) for PFI5_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI5_ZBAB1_ZBABRECORD.
*/
#define PFI5_ZBABRECORD1 (PFI5_ZBAB1_ZBABRECORD)

/** \brief C040, ZBAB Record 2 */
#define PFI5_ZBAB2_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8F8C040u)
/** Alias (User Manual Name) for PFI5_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI5_ZBAB2_ZBABRECORD.
*/
#define PFI5_ZBABRECORD2 (PFI5_ZBAB2_ZBABRECORD)

/** \brief C060, ZBAB Record 3 */
#define PFI5_ZBAB3_ZBABRECORD /*lint --e(923, 9078)*/ (*(volatile Ifx_PFI_ZBAB_ZBABRECORD*)0xA8F8C060u)
/** Alias (User Manual Name) for PFI5_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI5_ZBAB3_ZBABRECORD.
*/
#define PFI5_ZBABRECORD3 (PFI5_ZBAB3_ZBABRECORD)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPFI_REG_H */
